```
module.iam_github_oidc_provider.data.tls_certificate.this[0]: Reading...
module.iam_github_oidc_provider.data.tls_certificate.this[0]: Read complete after 0s [id=8d232a145587e7e891fc7c3dc13630d472810d21]
module.iam_github_oidc_provider.data.aws_partition.current: Reading...
data.aws_caller_identity.current: Reading...
module.ecr.data.aws_partition.current: Reading...
module.ecr.data.aws_caller_identity.current: Reading...
module.ecr.aws_ecr_repository.this[0]: Refreshing state... [id=paul-benetis/devops-toolkit]
aws_s3_bucket.tf_state: Refreshing state... [id=paulb-devops-toolkit-terraform-state]
module.ecr.data.aws_partition.current: Read complete after 0s [id=aws]
module.iam_github_oidc_provider.data.aws_partition.current: Read complete after 0s [id=aws]
module.iam_github_oidc_provider.aws_iam_openid_connect_provider.this[0]: Refreshing state... [id=arn:aws:iam::905207152945:oidc-provider/token.actions.githubusercontent.com]
data.aws_caller_identity.current: Read complete after 0s [id=905207152945]
module.ecr.data.aws_caller_identity.current: Read complete after 0s [id=905207152945]
module.iam_github_oidc_role.data.aws_partition.current: Reading...
module.iam_github_oidc_role.data.aws_caller_identity.current: Reading...
module.iam_github_oidc_role.data.aws_partition.current: Read complete after 0s [id=aws]
module.iam_github_oidc_role.data.aws_caller_identity.current: Read complete after 0s [id=905207152945]
module.iam_github_oidc_role.data.aws_iam_policy_document.this[0]: Reading...
module.iam_github_oidc_role.data.aws_iam_policy_document.this[0]: Read complete after 0s [id=898067848]
module.iam_github_oidc_role.aws_iam_role.this[0]: Refreshing state... [id=terraform-20250518221411969600000001]
module.ecr.aws_ecr_lifecycle_policy.this[0]: Refreshing state... [id=paul-benetis/devops-toolkit]
aws_iam_policy.iam_github_oidc_ecr_access: Refreshing state... [id=arn:aws:iam::905207152945:policy/GitHubOIDCECRAccess]
module.iam_github_oidc_role.aws_iam_role_policy_attachment.this["ECRPullPush"]: Refreshing state... [id=terraform-20250518221411969600000001-20250518221412692100000002]
aws_ecr_repository_policy.allow_pull_push: Refreshing state... [id=paul-benetis/devops-toolkit]
module.ecr.data.aws_iam_policy_document.repository[0]: Reading...
module.ecr.data.aws_iam_policy_document.repository[0]: Read complete after 0s [id=2942457173]
module.ecr.aws_ecr_repository_policy.this[0]: Refreshing state... [id=paul-benetis/devops-toolkit]
aws_s3_bucket_versioning.tf_state: Refreshing state... [id=paulb-devops-toolkit-terraform-state]

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create
  ~ update in-place

Terraform will perform the following actions:

  # aws_ecr_repository_policy.allow_pull_push will be updated in-place
  ~ resource "aws_ecr_repository_policy" "allow_pull_push" {
        id          = "paul-benetis/devops-toolkit"
      ~ policy      = jsonencode(
          ~ {
              ~ Statement = [
                  ~ {
                      ~ Action    = [
                          - "ecr:ListTagsForResource",
                          - "ecr:ListImages",
                          - "ecr:GetRepositoryPolicy",
                          - "ecr:GetLifecyclePolicyPreview",
                          - "ecr:GetLifecyclePolicy",
                            "ecr:GetDownloadUrlForLayer",
                          - "ecr:GetAuthorizationToken",
                          - "ecr:DescribeRepositories",
                          - "ecr:DescribeImages",
                          - "ecr:DescribeImageScanFindings",
                            "ecr:BatchGetImage",
                            # (1 unchanged element hidden)
                        ]
                      ~ Principal = {
                          - AWS = "arn:aws:iam::905207152945:role/terraform-20250518221411969600000001"
                        } -> "*"
                      ~ Sid       = "PrivateReadOnly" -> "AllowPullForAnyone"
                        # (1 unchanged attribute hidden)
                    },
                  ~ {
                      ~ Action    = [
                          - "ecr:UploadLayerPart",
                            "ecr:PutImage",
                            "ecr:InitiateLayerUpload",
                          + "ecr:UploadLayerPart",
                            "ecr:CompleteLayerUpload",
                        ]
                      ~ Sid       = "ReadWrite" -> "AllowPushForSpecificRole"
                        # (2 unchanged attributes hidden)
                    },
                ]
                # (1 unchanged attribute hidden)
            }
        )
        # (2 unchanged attributes hidden)
    }

  # github_actions_secret.aws_region will be created
  + resource "github_actions_secret" "aws_region" {
      + created_at      = (known after apply)
      + id              = (known after apply)
      + plaintext_value = (sensitive value)
      + repository      = "devops-toolkit"
      + secret_name     = "AWS_REGION"
      + updated_at      = (known after apply)
    }

  # github_actions_secret.iam_github_oidc_role will be created
  + resource "github_actions_secret" "iam_github_oidc_role" {
      + created_at      = (known after apply)
      + id              = (known after apply)
      + plaintext_value = (sensitive value)
      + repository      = "devops-toolkit"
      + secret_name     = "IAM_GITHUB_OIDC_ROLE"
      + updated_at      = (known after apply)
    }

Plan: 2 to add, 1 to change, 0 to destroy.

─────────────────────────────────────────────────────────────────────────────

Note: You didn't use the -out option to save this plan, so Terraform can't
guarantee to take exactly these actions if you run "terraform apply" now.
```

<!-- Sticky Pull Request Comment -->